Latest/0.orig/Te
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Te;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
  left     { type symmetryPlane; }
  right     { type symmetryPlane; }
  front     { type symmetryPlane; }
  back     { type symmetryPlane; }

    substrate
    {
        // Ambient-temperature solid boundary acts as a heat sink
        type            fixedValue;
        value           uniform 300;
    }
    donor
    {
        // Ambient-temperature solid boundary acts as a heat sink
        type            fixedValue;
        value           uniform 300;
    }
}


// ************************************************************************* //
