Latest/0.orig/rDeltaT
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      rDeltaT;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];    // 1/s

// dt floor = 1e-14 s  => rDeltaT = 1e14 1/s
internalField   uniform 1e14;

boundaryField
{
  left     { type symmetryPlane; }
  right     { type symmetryPlane; }
  front     { type symmetryPlane; }
  back     { type symmetryPlane; }

  substrate     { type zeroGradient; }
  donor     { type zeroGradient; }
}

// ************************************************************************* //
