Latest/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

substrateFixedVelocity
{
    type            vectorFixedValueConstraint;
    active          no;

    selectionMode   cellZone;
    cellZone        substrate;

    fieldValues
    {
        U   (0 0 0);
    }
}
substrateFixedTemperature
{
    type            scalarFixedValueConstraint;
    active          no;
    selectionMode   cellZone;
    cellZone        substrate;

    fieldValues
    {
        //T   500;
    }
}
// ************************************************************************* //
