Latest/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
        maxIter         50;

        nAlphaCorr      1;              // Keep at 1
        nAlphaSubCycles 3;              // Increased to stabilise transport
        cAlpha          0.5;            // Softer compression to avoid overshoot
        icAlpha         0;
        scAlpha         0;
        compressionLimiter 0.5;         // Caps phic relative to |phi|
        MULESCorr       true;
        nLimiterIter    2;
        alphaApplyPrevCorr false;
        sharpeningScheme standard;
        thinFilmCoeff   0.0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0;
        maxIter         100;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     2;
        relaxationFactor 0.3;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance   1e-8;
        relTol      0;
    }
    
    "U.*"
   {
        solver      smoothSolver;
        smoother    symGaussSeidel;
        nSweeps     2;
        tolerance   1e-08;
        relTol      0.1;
    }

    // Gas T (if present)
    T
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         4;
        maxIter         200;
        tolerance       5e-11;
        relTol          0;
    }
    TFinal
    {
        $T;
        nSweeps         6;
        tolerance       1e-11;
    }

    // Two-temperature fields
    Te
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         4;
        maxIter         300;
        tolerance       5e-11;
        relTol          0;
    }
    TeFinal
    {
        $Te;
        nSweeps         6;
        tolerance       1e-11;
    }
    Tl
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         4;
        maxIter         300;
        tolerance       5e-11;
        relTol          0;
    }
    TlFinal
    {
        $Tl;
        nSweeps         6;
        tolerance       1e-11;

    }
}

PIMPLE
{
    momentumPredictor           false;
    nOuterCorrectors            1;           // REDUCE: was 2 (emergency mode)
    nCorrectors                 1;
    nNonOrthogonalCorrectors    0;

    residualControl
    {
        "alpha.*" { tolerance 1e-5;  relTol 0.01; }
        p_rgh     { tolerance 1e-5;  relTol 0.01; }
        U         { tolerance 1e-6;  relTol 0.01; }
    }
    
    p_rghRefCell                0;
    p_rghRefValue               101325;     // Standard atmospheric
}

relaxationFactors
{
    fields
    {
        p_rgh           0.3;
        "alpha.*"       0.5;
    }
    equations
    {
        U               0.1;
        UFinal          0.8;
        T               0.4;
        Te              0.4;
        Tl              0.4;
        "alpha.*"       0.5;
        ".*Final"       0.8;
    }
}

// Pressure relaxation control
targetResP  0.5;

compInterFoamCoeffs
{
    maxReasonableVelocity  1000;        // REDUCE: was 1e5
    maxVelocity            500;         // REDUCE: was 5000
    defaultMetalDensity    4500;        
    defaultAirDensity      1.2;         
    maxInitialResidual     10;          // REDUCE: was 1e3

    // Interface clamp settings
    enableAlphaClamp  false;
    minAlpha          0.001;
    maxAlpha          0.999;

    // Pressure clamp settings
    pressureClamp      false;
    maxPressure        5e7;
    minPressure        -1e6;

    // Density clamp settings
    densityClamp       false;
    maxDensity         10000;
    minDensity         0.5;

    // RAU clamp settings
    enableRAUClamp     false;
    minRAU             1e-10;
    maxRAU             1e6;
    minRAUf            1e-14;
    maxRAUf            1e6;

    // RELAX RESIDUAL TARGETS
    targetResU         0.1;             // RELAX: was 0.05
}
